#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cluster_profile.prodaws: Refreshing state... [id=60106109e9febe3ecf90a896]
spectrocloud_cluster_profile.prod-gcp: Refreshing state... [id=6011089de9febeb60e08c2b6]
spectrocloud_cluster_profile.dev-gcp: Refreshing state... [id=6010610ae9febe3edbe4751f]
spectrocloud_cluster_profile.devvmware: Refreshing state... [id=6010610ae9febe3edef14b9a]
spectrocloud_cluster_profile.azure: Refreshing state... [id=6010610ae9febe3eda2c7612]
spectrocloud_cluster_profile.prodvmware: Refreshing state... [id=6010610ae9febe3ed7c7598b]
spectrocloud_cluster_aws.cluster: Refreshing state... [id=6010610ae9febe3ee228d7ed]
spectrocloud_cluster_gcp.cluster: Refreshing state... [id=6011bdecef54a3912411f918]
spectrocloud_cluster_vsphere.prod-vmware-1: Refreshing state... [id=6010610ae9febe3eecb7a00f]
spectrocloud_cluster_vsphere.prod-vmware-2: Refreshing state... [id=6010ce30e9febe8bd05a9979]
local_file.kubeconfig: Refreshing state... [id=9f10911ac8558323c71886252ab6259f07e64af4]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5ekNDQWJPZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1ERXlOakU0TXpZeE9Gb1hEVE14TURFeU5ERTROREV4T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBS1F0Cm1YOTFsT0ZSR0dCQ3p1UHhGdUgrK05aTFU4MEtrS2YyV2hZMm1yWDlaQzRwUHpLRkNpMjVpdjd5Y1RFSmVFRGEKVFpWbWJWQm9vbmRWczFVY2tMcUx1QmZLR3hnaWhhN0NXem92U1VVVURPUDM0WCtMV3h0ZkQvOXFudDNuOEwvYwpmVkhXKzkwbUZUT1ZZVGFnbytHRWVORWJjQnVVY1ZVeEJwR1NIaGUyTjlMaTMzdTU5MUw4cTRRZkU4MGdNd3N0ClUwa09BRHZRVTdMenhtR1M1UVNsSnZMTUxsdk9FZlhzYjNqYURjdjd0VFR2ZTNUSGxhVnlVbXBMMzc2N2tHSUkKVE40aDlyK3YyenhPaWRtZkNOejJmaWF0ZnVxVEJNcUgrWEFiQzhLRFZ5TjREZ0Y2Yy9IazA1dEd1TmN5bGNsbwpPMW9rUnpCNmNtOXE5bjNXN3hVQ0F3RUFBYU1tTUNRd0RnWURWUjBQQVFIL0JBUURBZ0trTUJJR0ExVWRFd0VCCi93UUlNQVlCQWY4Q0FRQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBSVR5SEUzNXNmWVR2Tk5NUm05UWZRZW0KbEZMeUNJTUJQN1Vhbm9kVk9VTUhFa1drY1hiNWJqTlBndnBwai94akpySDZyMVdZVzA1TzJBV3VucHhETXE2TAp1akNFQmtqOE4wVDJ3VWI4Z1dySWp0OXVCMTFVWWVwK2JOMGtHUVZHbkltNHI2QzJqWUZkaTk0enp2WStIOHNLClo3OGNtWWhoUTZ5eVhqbFJubjlFT3pQT2RaZnZZdERVOE1nZGVnQnByRmJiU2hzQk01cENYZzR4dDNuVnI2eXUKMlpGZWczQlZEMTRVUDBxWW5pMWhNUFZ4WVVFZkpKZHM4SDdPNGtIajBJTUZJSjI0ejZoeGR4c3dtUU1RTXQ0SgpGaFpvUldQY2UvV1hLNFZMUkZNYVVLUDh1TEt4eEhRY0oybFVxVHY4Vk9xVFJEM2dkZFYzbmRFSFovbVVLTHM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                server: https://aws-picard-3-apiserver-1962098459.us-west-2.elb.amazonaws.com:6443
              name: aws-picard-3
            contexts:
            - context:
                cluster: aws-picard-3
                user: aws-picard-3-admin
              name: aws-picard-3-admin@aws-picard-3
            current-context: aws-picard-3-admin@aws-picard-3
            kind: Config
            preferences: {}
            users:
            - name: aws-picard-3-admin
              user:
                client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4akNDQWRxZ0F3SUJBZ0lJQ1o3R3h3ODZBUkV3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TVRBeE1qWXhPRE0yTVRoYUZ3MHlNakF4TWpZeE9EUXhNVGxhTURReApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1Sa3dGd1lEVlFRREV4QnJkV0psY201bGRHVnpMV0ZrCmJXbHVNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQXNDZFBBWDNIdFowRmF4dkkKaTFhY3Z2bEpTd2lNTGs0TmtTSWtmeFVoZ0N0Sm9oL2FZc0ZsaTcxZ2JKRHNiT0hhZ1hCZENaVCtRWmZPV2hELwo2TlgrbUlDUHlEOEdEZ2tIMTljd3lpNlVMaHl6TG00MnAwN2ZUWDlscHUwYnptT2tSRmtET1FZVENJZ2Q4aXQvClJVeFkvMU5peWpQQnpCY2ZOZkZlTXNLTzR3SDMrQWpwMnVrb2JPVTB2NkZLZXNGTGszTHc0YXhveVFuUVgvRjEKaS94RFYzZUhWYTNvMm4vYSs5aS9TSEYyQXBsMnJNRnFtSVlobjduTkVidFZKYitkdmNyTXhTS1dvVElUYksrZwpiajdSTDFoWnJmdmJvZW82OUdzM1hOcGpVcnNqeUNFMEpTdWUrUDZpWWlXRlJWQXJFTTlBT0J5bGxxZnBHLzNGCnZVZkZRd0lEQVFBQm95Y3dKVEFPQmdOVkhROEJBZjhFQkFNQ0JhQXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFHaXg3Z0MrZUM0M3BPdjFWRXNKY0k4N0dZSlJlb0dnSG5KSApJa09uWDBLWlFPZ2xJbTBlSVdQaVdESkVXWmhSc1o5QUdOVzcraUxIKzRsUzRpYjFmWnhRYWNmekcrbjRhZ1R6CnRpR2VlcmlhRDlxOHpyZkpaN0p4bVhTZ1R1ZjNwRzUxOVE2MURlS3djZ3czWnZMTCt0MnBoeWhDei9zdUhhQy8KNE84T3ErTlR4TDV1OUtHaFc1ZG1waEZSY3pjUkxaUW4vN2FZS0ZjalFtL1B6U2NGSG1oODBpU1Nka3k1Tkd3OAptUytzWUJUZzhNaDMxNVJQZ2EzVDJRa0psRFVxSHdlTy9iWVY2eXA3RGFPby9EVHN3SWg0Wi9ST2Z0UzljOW85CmJUblV6RUhYNVNEb29zMUdWbjZjdElGSmdaT21nanFXL2ZJYTViQmt1QTIyWjFIVit6ND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=
                client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBc0NkUEFYM0h0WjBGYXh2SWkxYWN2dmxKU3dpTUxrNE5rU0lrZnhVaGdDdEpvaC9hCllzRmxpNzFnYkpEc2JPSGFnWEJkQ1pUK1FaZk9XaEQvNk5YK21JQ1B5RDhHRGdrSDE5Y3d5aTZVTGh5ekxtNDIKcDA3ZlRYOWxwdTBiem1Pa1JGa0RPUVlUQ0lnZDhpdC9SVXhZLzFOaXlqUEJ6QmNmTmZGZU1zS080d0gzK0FqcAoydWtvYk9VMHY2Rktlc0ZMazNMdzRheG95UW5RWC9GMWkveERWM2VIVmEzbzJuL2ErOWkvU0hGMkFwbDJyTUZxCm1JWWhuN25ORWJ0VkpiK2R2Y3JNeFNLV29USVRiSytnYmo3UkwxaFpyZnZib2VvNjlHczNYTnBqVXJzanlDRTAKSlN1ZStQNmlZaVdGUlZBckVNOUFPQnlsbHFmcEcvM0Z2VWZGUXdJREFRQUJBb0lCQVFDUkxuU2hLQWQzR1lragpzK3hmV3UwcFFOQTFkVUFEMGZUQWowRkJOQ3MrTlc4a25kZ2gySDlXNHFnY0VuMnBaNlB0VnF4M2YwTG0wTFVUCjZqcmdyYTUrQmtkNnBPYmFubnJHVytjc1c2TnBOZUkvL0RvelBvQXdvVFVvbFBkNzdRZXdCU1R3MUo3UFExQmIKRFpxQmhPRTgzbjduWkN6dmhvY0VzSUFRbWVXbUZkVXZFSHRDYUV2MFlONDByQ0pHd2YzQVpzKzBmTXdrY1VDWAp3djNZcHdrVVl0UytkQVlNL0w3K3lOSXNaWUJMdjVhWFpFaVZqTnB2RGFzOFdPTU9nVlNjTUhuenlFZzd3WnlhCmNFemVSUVRodnlGS0xyTnFWck5wTVNYZFJqU0FpdkdueUVjTGxubnlNbkxVNjhDajRBZWVvT0hEZUZyUjNySnIKQW9zZVRkcWhBb0dCQU5DMWdNWFZkV0U5b3VDNHZzTW1VbU1UbUhETDYrRlYyOWVQN3NLbEhGSG4wcWdXT29zbApEVERVcmswOUN3VEdUZU9CUnFtZ00xOFIrUE9XZVpWOGdJSFkyTWk1b2lIMDg5UXh5bWFtaVVjZGY1SCsxQzhuCjlMK0x5bU90NUEvNkl2MEF4Q3JnWGpmVlg1dWpDZVUrU3VkRmtVam4veWlRTXZnR1dOcG01Tk81QW9HQkFOZ1IKWUFyN3BNRWtyVFgvNE5ZOURCWkRKYTJQSmNXRnJRL1FOaW1OYjU0eHJobHFIeCtpcGJDNVk5MW9YTXlET2pCUgpaRFo1Q0RuNitzaXhyT0lvZmJqY0dLYlJSODhjckxIaldqTThwSlhicFV0bUE4NllrTzRGSktwbWVjejZOSERRCjQrR0JRSnFLYTFuditwOElyUnkvSjJkMUpqQlI1S2FTUXFpNzJ0YmJBb0dBTHJ5MmZaYnpsamNMUm0rWXFITG8KZUM5bkw3czZzMWRheDhiL25LOEV6SUt4ZGRxa2VZeHVpOFRVMDQ4YjdKSEwxMnFYdkZ5WHBHNk41VjZKRTZTeAowbUlSQ2NJb1FKcHVEOUttbEo0dWw3SlBZdzVCemQyUXZXUThpbDNpZUlGM1hGalRsUlp4Z3VkUlpiVDQvbEVZCnpQbVRNMVJnbTJEUFNTT0N1a1hZY0dFQ2dZRUFubTZISlNhR0ZWWEdhSDBhcVIwVVd0S2JzeHJ1MEZvSG56dkcKSzB2WlYzOElNUHgrbTl6UWI3aFF3TTNBbGZsM1ZteW45Y1Zqd2RnRndkbCtja3JNZlJ0dVBBdmpBcnY4NldkVApBWlRxL2pPVGphamRDOFVWS0dLL0V1K1hTalVBOU9SRzVGaTVQVmhZQlJlUmhzRis1a0JJTFhWYUxqNHVVZkdYClRWQ0owOWNDZ1lBeFNoS29CaWRpVGNpN1BIR0xOZGpZb2wxU3RrZjZxRFk0SmtmL2FvTFZqMC9IZ2krdTFmMXoKZ29CN0k5R0pEMkJPN1hUNngrTnZvZDQzWHFqTHpvdkpGZWNuTXhXeTA1UlJ3bjBHQmFsY3NlQk1uM1FpZzJjbwpvNHRsd3QyamVicVBjR3lHNnB4T09yY0ZiQnFEWmVmV0ZtMU1ZRFdFQk5BZUhiYVpWbWVJcVE9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo=
        EOT
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "kubeconfig_aws-2"
      + id                   = (known after apply)
    }

  # spectrocloud_cluster_aws.cluster will be updated in-place
  ~ resource "spectrocloud_cluster_aws" "cluster" {
        id                 = "6010610ae9febe3ee228d7ed"
        name               = "aws-picard-3"
        # (4 unchanged attributes hidden)


      + machine_pool {
          + azs                     = [
              + "us-west-2a",
            ]
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + disk_size_gb            = 65
          + instance_type           = "t3.large"
          + name                    = "worker-gpu"
          + update_strategy         = "RollingUpdateScaleOut"
        }
        # (3 unchanged blocks hidden)
    }

  # spectrocloud_cluster_aws.cluster2 will be created
  + resource "spectrocloud_cluster_aws" "cluster2" {
      + cloud_account_id   = "60010f4a042c47c320ef22a5"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60106109e9febe3ecf90a896"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "aws-picard-5"

      + cloud_config {
          + region       = "us-west-2"
          + ssh_key_name = "default"
        }

      + machine_pool {
          + azs                     = [
              + "us-west-2a",
            ]
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + disk_size_gb            = 65
          + instance_type           = "t3.large"
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"
        }
      + machine_pool {
          + azs                     = [
              + "us-west-2a",
            ]
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + disk_size_gb            = 62
          + instance_type           = "t3.large"
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `sandbox`, Workflow: `Terraform Plan`*